---
type: AnalyticalSurfaceBase
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 5
tags: [revit-api, class]
---

# AnalyticalSurfaceBase

`Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetOuterContour | 2023 | `public CurveLoop GetOuterContour ()` |
| Method | IsCurveLoopValid | 2023 | `public static bool IsCurveLoopValid ( CurveLoop profile )` |
| Method | SetOuterContour | 2023 | `public void SetOuterContour ( CurveLoop outerContour )` |
| Property | Parameter | — | `` |
| Property | SketchId | 2023 | `public ElementId SketchId { get ; }` |